#+name: party
|  1 | ПОЛІТИЧНА ПАРТІЯ "СЛУГА НАРОДУ"                         | 43.14 | 6161917 |
|  2 | Політична партія "ОПОЗИЦІЙНА ПЛАТФОРМА – ЗА ЖИТТЯ"      | 13.03 | 1862291 |
|  3 | політична партія Всеукраїнське об’єднання "Батьківщина" |  8.18 | 1168673 |
|  4 | Політична партія "Європейська Солідарність"             |  8.12 | 1160146 |
|  5 | Політична Партія "ГОЛОС"                                |  5.84 |  834306 |
|  6 | ПОЛІТИЧНА ПАРТІЯ "РАДИКАЛЬНА ПАРТІЯ ОЛЕГА ЛЯШКА"        |  4.01 |  573892 |
|  7 | ПОЛІТИЧНА ПАРТІЯ "СИЛА І ЧЕСТЬ"                         |  3.81 |  545547 |
|  8 | Політична партія "ОПОЗИЦІЙНИЙ БЛОК"                     |  3.04 |  434337 |
|  9 | ПОЛІТИЧНА ПАРТІЯ "УКРАЇНСЬКА СТРАТЕГІЯ ГРОЙСМАНА"       |  2.39 |  342665 |
| 10 | ПОЛІТИЧНА ПАРТІЯ "ПАРТІЯ ШАРІЯ"                         |  2.23 |  319903 |
| 11 | політична партія Всеукраїнське об’єднання "Свобода"     |  2.16 |  308821 |
| 12 | політична партія "Громадянська позиція"                 |  1.04 |  149966 |
| 13 | ПОЛІТИЧНА ПАРТІЯ "ПАРТІЯ ЗЕЛЕНИХ УКРАЇНИ"               |  0.66 |   94354 |
| 14 | Політична партія "Об’єднання "САМОПОМІЧ"                |  0.62 |   89946 |
| 15 | Аграрна партія України                                  |  0.51 |   73804 |
| 16 | Політична партія "Рух Нових Сил Михайла Саакашвілі"     |  0.46 |   66266 |
| 17 | Політична партія "Сила Людей"                           |  0.19 |   27442 |
| 18 | ПОЛІТИЧНА ПАРТІЯ "СИЛА ПРАВА"                           |  0.14 |   20215 |
| 19 | ПОЛІТИЧНА ПАРТІЯ "СОЦІАЛЬНА СПРАВЕДЛИВІСТЬ"             |  0.11 |   16977 |
| 20 | Політична Партія "ПАТРІОТ"                              |  0.10 |   15461 |
| 21 | ПОЛІТИЧНА ПАРТІЯ "НЕЗАЛЕЖНІСТЬ"                         |  0.05 |    7815 |
| 22 | ПОЛІТИЧНА ПАРТІЯ "ВСЕУКРАЇНСЬКЕ ОБ’ЄДНАННЯ "ФАКЕЛ"      |  0.05 |    7761 |

#+BEGIN_SRC lisp :var party=party
    (defun push-n (lst times)
      (assert (< 0 times))
      (loop
	 :for i :from 0 :to times
	 :for j :in lst :by #'cdr
	 :collect j))

  (let* ((lst (push-n party 5))
	 (summ (apply #'+ (mapcar #'fourth lst))))
    (mapcar #'(lambda (el)
		(let ((percet (* 100.0 (/ (fourth el) summ )) ))
		  (push percet el)
		  (push (round (* 225/100 percet)) el)
		  )) lst))

#+END_SRC

#+RESULTS:
| 118 | 52.391796 | 1 | ПОЛІТИЧНА ПАРТІЯ "СЛУГА НАРОДУ"                         | 43.14 | 6161917 |
|  36 | 15.834159 | 2 | Політична партія "ОПОЗИЦІЙНА ПЛАТФОРМА – ЗА ЖИТТЯ"      | 13.03 | 1862291 |
|  22 |  9.936661 | 3 | політична партія Всеукраїнське об’єднання "Батьківщина" |  8.18 | 1168673 |
|  22 |   9.86416 | 4 | Політична партія "Європейська Солідарність"             |  8.12 | 1160146 |
|  16 |    7.0937 | 5 | Політична Партія "ГОЛОС"                                |  5.84 |  834306 |
|  11 | 4.8795257 | 6 | ПОЛІТИЧНА ПАРТІЯ "РАДИКАЛЬНА ПАРТІЯ ОЛЕГА ЛЯШКА"        |  4.01 |  573892 |
